content/lectures/combinatorics.md
+++
title = "Combinatorics"
author = ["Mattox Beckman"]
draft = false
type = "page"
+++

## Synopsis {#synopsis}

Many problems involve combinatorial reasoning.  Today we will talk about four
sequences that come up: Fibonacci, Binomial Coefficients, Derangements, and Catalan Numbers.


## Slides {#slides}

-   [Combinatorics](/slides/combinatorics.pdf)


## Recommended Reading {#recommended-reading}


## In-class Problems {#in-class-problems}

-   {{<UVa2 number="10541" >}}  Note that 50 digits requires 166 bits.  You probably want Python or Java.
